

# It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? 
# Take this monstrosity as the DataFrame to use in the following puzzles:

In [12]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [13]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Question No 1
# Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column

In [14]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df.FlightNumber

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [15]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"



# Question No 2
# The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [16]:
df['temporary DataFrame'] = df.From_To.str.replace("_"," ")

In [17]:
df

            From_To  FlightNumber  ...              Airline temporary DataFrame
0      LoNDon_paris         10045  ...               KLM(!)        LoNDon paris
1      MAdrid_miLAN         10055  ...    <Air France> (12)        MAdrid miLAN
2  londON_StockhOlm         10065  ...  (British Airways. )    londON StockhOlm
3    Budapest_PaRis         10075  ...       12. Air France      Budapest PaRis
4   Brussels_londOn         10085  ...          "Swiss Air"     Brussels londOn

[5 rows x 5 columns]


# Question No 3
# Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [18]:
df.apply(lambda x: x.astype(str).str.title())

            From_To FlightNumber  ...              Airline temporary DataFrame
0      London_Paris        10045  ...               Klm(!)        London Paris
1      Madrid_Milan        10055  ...    <Air France> (12)        Madrid Milan
2  London_Stockholm        10065  ...  (British Airways. )    London Stockholm
3    Budapest_Paris        10075  ...       12. Air France      Budapest Paris
4   Brussels_London        10085  ...          "Swiss Air"     Brussels London

[5 rows x 5 columns]

# Question No 4
# Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [19]:
del df['From_To']
df

   FlightNumber  RecentDelays              Airline temporary DataFrame
0         10045      [23, 47]               KLM(!)        LoNDon paris
1         10055            []    <Air France> (12)        MAdrid miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON StockhOlm
3         10075          [13]       12. Air France      Budapest PaRis
4         10085      [67, 32]          "Swiss Air"     Brussels londOn

# Question No 5
# In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

# Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [20]:
df.assign(**pd.DataFrame(df['RecentDelays'].tolist()).add_prefix('Recent_'))

   FlightNumber  RecentDelays  ... Recent_1 Recent_2
0         10045      [23, 47]  ...     47.0      NaN
1         10055            []  ...      NaN      NaN
2         10065  [24, 43, 87]  ...     43.0     87.0
3         10075          [13]  ...      NaN      NaN
4         10085      [67, 32]  ...     32.0      NaN

[5 rows x 7 columns]